package 뮤직플레이어;

import java.util.ArrayList;
import java.util.Scanner;

import javazoom.jl.player.MP3Player;

public class Main {

	public static void main(String[] args) {
		//1.재생 2. 정지 3. 이전곡 4. 다음곡 5. 목록 6. 종료
		Scanner sc= new Scanner(System.in);
		MP3Player mp3=new MP3Player();
		String text="\r\n"
				+ "                            ...  ...,~;*==$=======*;~.  .    .                                      \r\n"
				+ "                               .,~;!!;:~-,,,,,,,,,-~!!!:~,                                          \r\n"
				+ "                              ,;!;:-,.,..,.........,.,,~;!;,.                                       \r\n"
				+ "                           ..;=:,,,,.,,.,..,,,,,,,,,,,,,,,:=:..                                     \r\n"
				+ "                          .-*;,.. ...,,,,,,,,,,,,,,,,,,,,,,,!;,.                                    \r\n"
				+ "                         .:!~.    .,,..,,,,,,,,,,..,,,,,,,..,:!.                                    \r\n"
				+ "                   ..  ..:!,.     .,,,,,,,,,,,,,,,,,..,,,,,,,,~=.                                   \r\n"
				+ "                    .   ~!,.     .,,,,,,,,,,,,,,,,,,,,.,,,,,,.,!:                                   \r\n"
				+ "                    .  ,!-,     .,,,,,,,,,,,,,,,,,,,,,.,,,,,,,,,*,                                ..\r\n"
				+ "                    ...;:,.    .,,,,,,,,,,,,,,,,,,,,.:,,,,,,,..,;~                 .              ..\r\n"
				+ "                    ..,=,..   .,,,,,.,,,,,,,,,,,,,,,,,~.,,,,,,,.~;              ....              ..\r\n"
				+ "                   ...;~... ..,,,,,-,,,,,,,,,,,,,,,,.,~,,,,,,,,,-!.              ...              ..\r\n"
				+ "                     ,*,.,,..,.,,,,-:-,.,,,,,,,,,,,,,,--.,,,,,,,,*.               .                 \r\n"
				+ "      .              ~:,,,,,,,,,,,,.,;,.,,.,,,,,,,,,.,-~,,,,,,,,,!,               ...               \r\n"
				+ "                     :~,,,,,,,,,,,.,,-~,,,.,,,,,,,,,,,~~,-,,,,,.,;-               ..                \r\n"
				+ "                    .;~,,,,,,,,,,,,,,,~,,,.,,,,,,,,,,~,--~,,,,,.,:~                                 \r\n"
				+ "                    .;-,,,,,,,,,,,,,,.:-,,.,,,,,,,,,,!,,!,,,,,...~:.                                \r\n"
				+ "                    ,;,,,,,,,,,,,,,,,,~,,,.,,,,,,,,,.-,,!,,,,,..,-!.                                \r\n"
				+ "                    ,;,,,,,,,,,,,,,,,:-,,,,.,,,,,,,,.,:,~,,,,,..,,:;.                               \r\n"
				+ ".                   ,!,,,,,,,,,,,,,,:~,,,,,..,,,,,,,,,:--,,,,,,,..,;-                               \r\n"
				+ "....                ,!,.,,,,,,,,,,,,*..,,,,,,,,,,,,,,,:-~.,,,,,,...~~                               \r\n"
				+ "....  .             ,!,.,,,,,,,,,,,,!,,.,,,,,,,,,~-,,:,.:,,,,,,,,,,~:                               \r\n"
				+ "...   .             .;,.,,,,,,,,,,,,;,,.,,,,,,,~!:,,,~,,,,~~,,,,..,:~                               \r\n"
				+ ".                   .;-.,,,,,,,,,,.,,;,,,.,-~;*~-~*-,.,-,,:*:,,,.,,*.                               \r\n"
				+ "                    .;-,,,,,,,,,,,,,.,,,.,-*:------;,,,;-:~-~;::,,!~                                \r\n"
				+ "                    .;~,.,,,,,,,,,,,,,~~.,-::;!**!;;-,,!:~-~~~~!,!~                                 \r\n"
				+ "                ..  .::,.,,,,,,,,,,,,,,~;~!;, !!;* ~~,,;;*;**==*:*.                                 \r\n"
				+ "                     -!,,,,,,,,,,,,,,.,--,~, .,;:- ~-,.::,.:!!,~:*.                                 \r\n"
				+ "                     .*-,,,,,,,,,,,,,.,--,,~-. .. :~,,,,~:..-,-:~*.                                 \r\n"
				+ "                      -=.,,,,,,,,,~~.,,....,~!;:!;-~..,..-~..::,.-*.             .                  \r\n"
				+ "   .                  .*:,,,,,,,,,:-,,.,,,,...,.,-!.,.,,.~*;~,.,.,~:                                \r\n"
				+ "                       ,!-,.,,,,,,!,.,,,,,,,,,-~~~,,,,,,,-;~-,,,,,,!                                \r\n"
				+ "                       .~!,,,...,-;,.,,,,,,.,,---.,,,,,..-~,,,,,,,,*                                \r\n"
				+ "                       ..:*-,,...~:,,,,,,,,,,,,.,,.,,,,,,--,,,,,,.,;                                \r\n"
				+ "            .            .~!:,,.,-;,,,,,,,,.,,,,,,,,,,,,,:,,,,,.,.;-                                \r\n"
				+ "        ...               .,;*-.,,;~,,,,,,,.,,.,,~-,,,,,,!,,,,,,.:!                                 \r\n"
				+ "      ....                  ..!*-,~!,,,,,,,,,,,,-;.,.,,,.*:,,,,,:!                                  \r\n"
				+ "                               ,;$~-*:-,.,,,,,,,;-,,,.,..::-,,,:;.                                  \r\n"
				+ "                                -!,.-*:;!:-.,,,-;-:~,,,,,~;-,,;~.                                   \r\n"
				+ "                                ::..-!,,--!-,,.::,;::...,-!-,:-                                     \r\n"
				+ "            ..                 .*,,.-;,,.,-~,,,:,,,,~~-,~~:-.~,                                     \r\n"
				+ "            ..                 ,!,,,~:,,.,-~,,;,,,,,,:~-:-,~,~,                                     \r\n"
				+ "   .                           ::,.,:~,,,,~-,,!,,.,,,,,,,,.;,~,                                     \r\n"
				+ "       ..                     ,!-,..;-,,,,:,.-~.,.,-!!-:;,,;,:,                                     \r\n"
				+ "        .                     :!,,,.*,,,,,,.,~,,,,-~,,~~-:,-,:,                                     \r\n"
				+ "                          ....*-,,,,=,,,.,,.,~...~:,.;,,-~~,,~,                                     \r\n"
				+ "                      .....,,:!,...,#,,,,,.,,,,,~:-,;!~;~;;,,~.                                     \r\n"
				+ "                . .,-~~:;*!!*$,,..,,$,,,,,.,,,,,-;;-,--,-;-.,~.                                     \r\n"
				+ "               .,~!!;!;;!~,,;:.,,.,,*,,,,,.,,,,,,,;,,,.,-;,.,~.                                     \r\n"
				+ "      .    ..,~!*;~~:~:;:,,-;,,,,,,-!,,,,,.,,,,,,.-;-,--!,,,,~,                                     \r\n"
				+ "         .,~;!!:~~~~~~:!,,,--,.,,,.~:,,,,,.,,,,,,.,,~::~,..,,~,                                     \r\n"
				+ "       .,:!!;~~~~~~~~~;~,,,,,,,,,,,:-,,,,,.,,,,,,..,~~~~,.,,,~,                                     \r\n"
				+ "    ...~*!:~~~~~~~~-~~!..,,,,,,,,,,;-,,,,,.,,,,,,,,,,-,,,,,,,:-.                                    \r\n"
				+ "  ..,~!!:~~~~~~~~~~~~:;,.,,,,,,,,,,:-,,.,,.,,,,,,,,,,--,,..,,-!~.                                   \r\n"
				+ "  .-!!;~--~~~~~~~~~~~:~,.,,,,,,,,,,~!,,,,,.,,,,,,,..,~~~:,,,,.,;-                                   \r\n"
				+ " .~*;:~~~~~~~~~~~~~~~;-..,,,,,,,,,,,!!,,,,.,,,,,,,,,,,,,-:,,,,,,;        .                        ..\r\n"
				+ ",;!~~~~~~~~~~~~~~~~~~;-,.,,,,,,,,,,.,;;-,,,,,,,,,,,,,,,,,-~..,,,!. .                              ..\r\n"
				+ "!!:~~~~~~~~~~~~~~~~~~;~,.,,,,,,,,,,.,,~;:-,,,,,,,.......,-~,.,,,*-.                                .\r\n"
				+ ";~~:::::~~~~~~~~~~~~~:~,,,,,,,,,,,,,,,,,~!;-.,.,,.,...,..-:,,,,;*!,.                               .\r\n"
				+ ":!***=*==*;:~~~~~~~~~~;,,,,,,,,,,,,,,.,,,,~*;-,,,,,...,,,-:--;=!~:=~,..                            .\r\n"
				+ "!:~~~~~~~:!!!;~~~~~~~~!,,,,,,,,,,,,,,..,,,,,~;;:~,,,,,,,~;**!;:~~~*;;:..                           .\r\n"
				+ "~~~~~~~~~~~~:!!~~~~~~~;:,,,,,,.,,,,,,,,,,,,,,,-~;!!;::;!;~;:~~~-~~~~:;;,                 ...     ...\r\n"
				+ "~~~~~~~~~~~~~~!;~~~~~~~*,,,,,,,,,,,,,,,,,,,,,,.,,,;~;:-,.,:~~~~~~~~~~~:!,                 .      ...\r\n"
				+ "~~~~~~~~~~~~~~~!:~~~-~~::,,-~~,,,,,,,,,,,,,,,,,,,~-.,.,.,,:~~~~~~~~~~~~:;,                  .   ....\r\n"
				+ "~~~~~~~~~~~~~~~:!;~--~~~;-,---~,,,,,,,,,,,,,,,,,~:,.,.,,,-:~~~~~~~~~~~~~;!.              ...........\r\n"
				+ "~~~~~~~~~~~~~~~~:!:~-~~~:;,-;-~,.,,,,,,,,,,,,,.~-,,,,,,.,~:~~~~~~~~~~~~~~!~..        .......,,,,.,,,\r\n"
				+ "~~~~~~~~~~~~~~~~~;;~~~~~~:;,,,:,~-,,.,,,,,,,,,.,,,,,,,,,~;~~~~~~~~~~~~~~~~!-.   .........,,,,,,,,,,,\r\n"
				+ "~~~~~~~~~~~~~~~~~:!:~~~~~~::-~~~-~-,,,,,,,,,--,,,.,,,,,~!~~~~~~~~~~~~~~~~~;~.. .......,,,,---------,\r\n"
				+ "~~~~~~~~~~~~~~~~~~;;~~~~~~~;!-,:--~~,,,-~-,:::,,,..,,.~;:~~~~~~~~~~~~~~~~~;:,.........,,------------\r\n"
				+ " ";
		//mp3노래를 실행하기 위해서는 노래가 위치하고 있는 경로가 필요
		//mp3.play("C:\\Users\\user\\Desktop\\mp3\\뉴진스-HypeBoy.mp3");
		
		//가수명 String 2. 노래제목(String) 3. 출시년도 4. 시간
		MusicPlayer mp_1= new MusicPlayer("뉴진스","HypeBoy",2023,90, "C:\\Users\\user\\Desktop\\mp3\\뉴진스-HypeBoy.mp3");
		MusicPlayer mp_2= new MusicPlayer("르세라핌","Anrifragile",2023,90,"C:\\Users\\user\\Desktop\\mp3\\르세라핌-Antifragile.mp3");
		MusicPlayer mp_3= new MusicPlayer("아이브","LoveDive",2023,90,"C:\\Users\\user\\Desktop\\mp3\\아이브-LoveDive.mp3");
		MusicPlayer mp_4= new MusicPlayer("윤하","사건의 지평선",2023,90,"C:\\Users\\user\\Desktop\\mp3\\윤하-사건의지평선.mp3");
		MusicPlayer mp_5= new MusicPlayer("카라","When I Move",2023,90,"C:\\Users\\user\\Desktop\\mp3\\카라-WhenIMove.mp3");
//		MusicPlayer mp_6= new MusicPlayer("진성","보릿고개",2023,90);
//		MusicPlayer mp_7= new MusicPlayer("체리필터","오리날다",2023,90);
		ArrayList<MusicPlayer> m_List=new ArrayList<>();
		m_List.add(mp_1);
		m_List.add(mp_2);
		m_List.add(mp_3);
		m_List.add(mp_4);
		m_List.add(mp_5);
		//m_List.add(mp_6);
		//m_List.add(mp_7);
		int point= 0;
		while(true) {
			System.out.println("1.재생 2. 정지 3. 이전곡 4. 다음곡 5. 목록 6. 종료");
			int menu= sc.nextInt();
			if(menu==1) {
				System.out.println("===========재생============");
				System.out.println(point+1+". "+m_List.get(point).getSinger()+"("+m_List.get(point).getYear() +")-"+m_List.get(point).getTitle()+"("+m_List.get(point).getTime()+"초)");
				if(mp3.isPlaying()) {
					mp3.stop();
					
				}
				mp3.play(m_List.get(point).getPath());				
				
			}else if(menu==2) {
				System.out.println("===========정지==========");
				System.out.println(point+1+". "+m_List.get(point).getSinger()+"("+m_List.get(point).getYear() +")-"+m_List.get(point).getTitle()+"("+m_List.get(point).getTime()+"초)");
				if(mp3.isPlaying()) {
					mp3.stop();
				}
			}else if(menu==3) {
				if (point==0) {
					System.out.println(point+1+". "+m_List.get(point).getSinger()+"("+m_List.get(point).getYear() +")-"+m_List.get(point).getTitle()+"("+m_List.get(point).getTime()+"초)");
				}else {
					point--;
					System.out.println(point+1+". "+m_List.get(point).getSinger()+"("+m_List.get(point).getYear() +")-"+m_List.get(point).getTitle()+"("+m_List.get(point).getTime()+"초)");	
				}
				if(mp3.isPlaying()) {
					mp3.stop();
				}
				mp3.play(m_List.get(point).getPath());		
				
			}else if(menu==4) {
				System.out.println("=========다음곡===========");
				//현재 1, 아이들 퀸카(90초) 노래가 나온다면 다음곡을 선택할 시 
				// 2. 윤하 사건의 지평선이 출력되게 해주세요
				//힌트 . 현재 몇번째 노래가 실행되고 있는지 위치를 알고 있는 변수가 필요
				point++;
				System.out.println(point+1+". "+m_List.get(point).getSinger()+"("+m_List.get(point).getYear() +")-"+m_List.get(point).getTitle()+"("+m_List.get(point).getTime()+"초)");
				if(point==m_List.size()-1) {
					System.out.println("마지막 곡입니다. 플레이리스트를 처음으로 되돌립니다.");
					point=0;
				}
				if(mp3.isPlaying()) {
					mp3.stop();
				}
				mp3.play(m_List.get(point).getPath());		
			}else if(menu==5) {
				System.out.println("목록");
				//1.아이들(2023) -퀸카(90초)
				for(int i=0;i<m_List.size();i++) 
					System.out.println(i+". "+m_List.get(i).getSinger()+"("+m_List.get(i).getYear() +")-"+m_List.get(i).getTitle()+"("+m_List.get(i).getTime()+"초)");
				}
			else if(menu==6) {
				System.out.println("프로그램을 종료합니다.");
				System.out.println(text);
				break;
			}
			
		}
		sc.close();
		

	}

}
